Revit 2027 API
View.IsWorksetVisible Method
 Indicates whether the workset is visible in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWorksetVisible(
	WorksetId worksetId
)
Public Function IsWorksetVisible (
	worksetId As WorksetId
) As Boolean
public:
bool IsWorksetVisible(
	WorksetId^ worksetId
)
member IsWorksetVisible :
        worksetId : WorksetId -> bool
Parameters
worksetId WorksetId
 Id of the workset.
Return Value
Boolean
 Whether the workset is visible.
Exceptions
Exception | Condition
ArgumentException |  There is no workset with this Id in the document associated with this view.
ArgumentNullException |  A non-optional argument was null
Remarks
 It will take into account whether the workset is opened or closed.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace